Revit 2027 API
StairsNumberSystemReferenceOption Enumeration
 The reference types permitted for a number system to refer to the geometry of a stairs run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StairsNumberSystemReferenceOption
Public Enumeration StairsNumberSystemReferenceOption
public enum class StairsNumberSystemReferenceOption
type StairsNumberSystemReferenceOption
Members
Member name | Value | Description
Center | 0 |  The number system reference to stairs path.
Left | 1 |  The number system reference to left boundary of stairs.
LeftQuarter | 3 |  The number system reference to left quarter of stairs
Right | 2 |  The number system reference to right boundary of stairs.
RightQuarter | 4 |  The number system reference to right quarter of stairs
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace